SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_demap.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 DEMAP register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_DEMAP_H
#define EFR32FG25_DEMAP_H
#define DEMAP_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_DEMAP DEMAP
 * @{
 * @brief EFR32FG25 DEMAP Register Declaration.
 *****************************************************************************/

/** DEMAP FIFOIN Register Group Declaration. */
typedef struct {
  __IOM uint32_t FIFOIN;                             /**< New Register                                       */
} DEMAP_FIFOIN_TypeDef;

/** DEMAP FIFOOUT Register Group Declaration. */
typedef struct {
  __IM uint32_t FIFOOUT;                             /**< New Register                                       */
} DEMAP_FIFOOUT_TypeDef;

/** DEMAP DEMAPLLR Register Group Declaration. */
typedef struct {
  __IOM uint32_t CTRL;                               /**< New Register                                       */
} DEMAP_DEMAPLLR_TypeDef;

/** DEMAP DEMAPERR Register Group Declaration. */
typedef struct {
  __IOM uint32_t CTRL;                               /**< New Register                                       */
} DEMAP_DEMAPERR_TypeDef;

/** DEMAP Register Declaration. */
typedef struct {
  __IM uint32_t          IPVERSION;             /**< IP Version ID                                      */
  __IOM uint32_t         EN;                    /**< Module Enable                                      */
  __IOM uint32_t         SWRST;                 /**< Software Reset                                     */
  __IOM uint32_t         CONNECT;               /**< New Register                                       */
  __IOM uint32_t         DISCLK;                /**< Disable Clocks                                     */
  uint32_t               RESERVED0[3U];         /**< Reserved for future use                            */
  DEMAP_FIFOIN_TypeDef   FIFOIN[3U];            /**<                                                    */
  uint32_t               RESERVED1[5U];         /**< Reserved for future use                            */
  DEMAP_FIFOOUT_TypeDef  FIFOOUT[4U];           /**<                                                    */
  uint32_t               RESERVED2[20U];        /**< Reserved for future use                            */
  uint32_t               RESERVED3[2U];         /**< Reserved for future use                            */
  __IOM uint32_t         FMTINCSI;              /**< New Register                                       */
  uint32_t               RESERVED4[5U];         /**< Reserved for future use                            */
  uint32_t               RESERVED5[2U];         /**< Reserved for future use                            */
  __IOM uint32_t         FMTOUTLLR;             /**< New Register                                       */
  uint32_t               RESERVED6[1U];         /**< Reserved for future use                            */
  __IOM uint32_t         FMTOUTERR;             /**< New Register                                       */
  uint32_t               RESERVED7[83U];        /**< Reserved for future use                            */
  __IOM uint32_t         DEMAPCTRL;             /**< New Register                                       */
  __IOM uint32_t         DEMAPLLROUT;           /**< New Register                                       */
  __IOM uint32_t         DEMAPERROUT;           /**< New Register                                       */
  __IM uint32_t          DEMAPSTAT;             /**< New Register                                       */
  __IM uint32_t          DEMAPALARM;            /**< New Register                                       */
  uint32_t               RESERVED8[3U];         /**< Reserved for future use                            */
  DEMAP_DEMAPLLR_TypeDef DEMAPLLR[10U];         /**<                                                    */
  uint32_t               RESERVED9[6U];         /**< Reserved for future use                            */
  DEMAP_DEMAPERR_TypeDef DEMAPERR[2U];          /**<                                                    */
  uint32_t               RESERVED10[862U];      /**< Reserved for future use                            */
  __IM uint32_t          IPVERSION_SET;         /**< IP Version ID                                      */
  __IOM uint32_t         EN_SET;                /**< Module Enable                                      */
  __IOM uint32_t         SWRST_SET;             /**< Software Reset                                     */
  __IOM uint32_t         CONNECT_SET;           /**< New Register                                       */
  __IOM uint32_t         DISCLK_SET;            /**< Disable Clocks                                     */
  uint32_t               RESERVED11[3U];        /**< Reserved for future use                            */
  DEMAP_FIFOIN_TypeDef   FIFOIN_SET[3U];        /**<                                                    */
  uint32_t               RESERVED12[5U];        /**< Reserved for future use                            */
  DEMAP_FIFOOUT_TypeDef  FIFOOUT_SET[4U];       /**<                                                    */
  uint32_t               RESERVED13[20U];       /**< Reserved for future use                            */
  uint32_t               RESERVED14[2U];        /**< Reserved for future use                            */
  __IOM uint32_t         FMTINCSI_SET;          /**< New Register                                       */
  uint32_t               RESERVED15[5U];        /**< Reserved for future use                            */
  uint32_t               RESERVED16[2U];        /**< Reserved for future use                            */
  __IOM uint32_t         FMTOUTLLR_SET;         /**< New Register                                       */
  uint32_t               RESERVED17[1U];        /**< Reserved for future use                            */
  __IOM uint32_t         FMTOUTERR_SET;         /**< New Register                                       */
  uint32_t               RESERVED18[83U];       /**< Reserved for future use                            */
  __IOM uint32_t         DEMAPCTRL_SET;         /**< New Register                                       */
  __IOM uint32_t         DEMAPLLROUT_SET;       /**< New Register                                       */
  __IOM uint32_t         DEMAPERROUT_SET;       /**< New Register                                       */
  __IM uint32_t          DEMAPSTAT_SET;         /**< New Register                                       */
  __IM uint32_t          DEMAPALARM_SET;        /**< New Register                                       */
  uint32_t               RESERVED19[3U];        /**< Reserved for future use                            */
  DEMAP_DEMAPLLR_TypeDef DEMAPLLR_SET[10U];     /**<                                                    */
  uint32_t               RESERVED20[6U];        /**< Reserved for future use                            */
  DEMAP_DEMAPERR_TypeDef DEMAPERR_SET[2U];      /**<                                                    */
  uint32_t               RESERVED21[862U];      /**< Reserved for future use                            */
  __IM uint32_t          IPVERSION_CLR;         /**< IP Version ID                                      */
  __IOM uint32_t         EN_CLR;                /**< Module Enable                                      */
  __IOM uint32_t         SWRST_CLR;             /**< Software Reset                                     */
  __IOM uint32_t         CONNECT_CLR;           /**< New Register                                       */
  __IOM uint32_t         DISCLK_CLR;            /**< Disable Clocks                                     */
  uint32_t               RESERVED22[3U];        /**< Reserved for future use                            */
  DEMAP_FIFOIN_TypeDef   FIFOIN_CLR[3U];        /**<                                                    */
  uint32_t               RESERVED23[5U];        /**< Reserved for future use                            */
  DEMAP_FIFOOUT_TypeDef  FIFOOUT_CLR[4U];       /**<                                                    */
  uint32_t               RESERVED24[20U];       /**< Reserved for future use                            */
  uint32_t               RESERVED25[2U];        /**< Reserved for future use                            */
  __IOM uint32_t         FMTINCSI_CLR;          /**< New Register                                       */
  uint32_t               RESERVED26[5U];        /**< Reserved for future use                            */
  uint32_t               RESERVED27[2U];        /**< Reserved for future use                            */
  __IOM uint32_t         FMTOUTLLR_CLR;         /**< New Register                                       */
  uint32_t               RESERVED28[1U];        /**< Reserved for future use                            */
  __IOM uint32_t         FMTOUTERR_CLR;         /**< New Register                                       */
  uint32_t               RESERVED29[83U];       /**< Reserved for future use                            */
  __IOM uint32_t         DEMAPCTRL_CLR;         /**< New Register                                       */
  __IOM uint32_t         DEMAPLLROUT_CLR;       /**< New Register                                       */
  __IOM uint32_t         DEMAPERROUT_CLR;       /**< New Register                                       */
  __IM uint32_t          DEMAPSTAT_CLR;         /**< New Register                                       */
  __IM uint32_t          DEMAPALARM_CLR;        /**< New Register                                       */
  uint32_t               RESERVED30[3U];        /**< Reserved for future use                            */
  DEMAP_DEMAPLLR_TypeDef DEMAPLLR_CLR[10U];     /**<                                                    */
  uint32_t               RESERVED31[6U];        /**< Reserved for future use                            */
  DEMAP_DEMAPERR_TypeDef DEMAPERR_CLR[2U];      /**<                                                    */
  uint32_t               RESERVED32[862U];      /**< Reserved for future use                            */
  __IM uint32_t          IPVERSION_TGL;         /**< IP Version ID                                      */
  __IOM uint32_t         EN_TGL;                /**< Module Enable                                      */
  __IOM uint32_t         SWRST_TGL;             /**< Software Reset                                     */
  __IOM uint32_t         CONNECT_TGL;           /**< New Register                                       */
  __IOM uint32_t         DISCLK_TGL;            /**< Disable Clocks                                     */
  uint32_t               RESERVED33[3U];        /**< Reserved for future use                            */
  DEMAP_FIFOIN_TypeDef   FIFOIN_TGL[3U];        /**<                                                    */
  uint32_t               RESERVED34[5U];        /**< Reserved for future use                            */
  DEMAP_FIFOOUT_TypeDef  FIFOOUT_TGL[4U];       /**<                                                    */
  uint32_t               RESERVED35[20U];       /**< Reserved for future use                            */
  uint32_t               RESERVED36[2U];        /**< Reserved for future use                            */
  __IOM uint32_t         FMTINCSI_TGL;          /**< New Register                                       */
  uint32_t               RESERVED37[5U];        /**< Reserved for future use                            */
  uint32_t               RESERVED38[2U];        /**< Reserved for future use                            */
  __IOM uint32_t         FMTOUTLLR_TGL;         /**< New Register                                       */
  uint32_t               RESERVED39[1U];        /**< Reserved for future use                            */
  __IOM uint32_t         FMTOUTERR_TGL;         /**< New Register                                       */
  uint32_t               RESERVED40[83U];       /**< Reserved for future use                            */
  __IOM uint32_t         DEMAPCTRL_TGL;         /**< New Register                                       */
  __IOM uint32_t         DEMAPLLROUT_TGL;       /**< New Register                                       */
  __IOM uint32_t         DEMAPERROUT_TGL;       /**< New Register                                       */
  __IM uint32_t          DEMAPSTAT_TGL;         /**< New Register                                       */
  __IM uint32_t          DEMAPALARM_TGL;        /**< New Register                                       */
  uint32_t               RESERVED41[3U];        /**< Reserved for future use                            */
  DEMAP_DEMAPLLR_TypeDef DEMAPLLR_TGL[10U];     /**<                                                    */
  uint32_t               RESERVED42[6U];        /**< Reserved for future use                            */
  DEMAP_DEMAPERR_TypeDef DEMAPERR_TGL[2U];      /**<                                                    */
} DEMAP_TypeDef;
/** @} End of group EFR32FG25_DEMAP */

/**************************************************************************//**
 * @addtogroup EFR32FG25_DEMAP
 * @{
 * @defgroup EFR32FG25_DEMAP_BitFields DEMAP Bit Fields
 * @{
 *****************************************************************************/

