SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_demap.h
/* Bit fields for DEMAP IPVERSION */
#define _DEMAP_IPVERSION_RESETVALUE                0x00000001UL                              /**< Default value for DEMAP_IPVERSION           */
#define _DEMAP_IPVERSION_MASK                      0xFFFFFFFFUL                              /**< Mask for DEMAP_IPVERSION                    */
#define _DEMAP_IPVERSION_IPVERSION_SHIFT           0                                         /**< Shift value for DEMAP_IPVERSION             */
#define _DEMAP_IPVERSION_IPVERSION_MASK            0xFFFFFFFFUL                              /**< Bit mask for DEMAP_IPVERSION                */
#define _DEMAP_IPVERSION_IPVERSION_DEFAULT         0x00000001UL                              /**< Mode DEFAULT for DEMAP_IPVERSION            */
#define DEMAP_IPVERSION_IPVERSION_DEFAULT          (_DEMAP_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for DEMAP_IPVERSION    */

/* Bit fields for DEMAP EN */
#define _DEMAP_EN_RESETVALUE                       0x00000000UL                         /**< Default value for DEMAP_EN                  */
#define _DEMAP_EN_MASK                             0x00000003UL                         /**< Mask for DEMAP_EN                           */
#define DEMAP_EN_EN                                (0x1UL << 0)                         /**< Module Enable                               */
#define _DEMAP_EN_EN_SHIFT                         0                                    /**< Shift value for DEMAP_EN                    */
#define _DEMAP_EN_EN_MASK                          0x1UL                                /**< Bit mask for DEMAP_EN                       */
#define _DEMAP_EN_EN_DEFAULT                       0x00000000UL                         /**< Mode DEFAULT for DEMAP_EN                   */
#define DEMAP_EN_EN_DEFAULT                        (_DEMAP_EN_EN_DEFAULT << 0)          /**< Shifted mode DEFAULT for DEMAP_EN           */
#define DEMAP_EN_DISABLING                         (0x1UL << 1)                         /**< Disablement Busy Status                     */
#define _DEMAP_EN_DISABLING_SHIFT                  1                                    /**< Shift value for DEMAP_DISABLING             */
#define _DEMAP_EN_DISABLING_MASK                   0x2UL                                /**< Bit mask for DEMAP_DISABLING                */
#define _DEMAP_EN_DISABLING_DEFAULT                0x00000000UL                         /**< Mode DEFAULT for DEMAP_EN                   */
#define DEMAP_EN_DISABLING_DEFAULT                 (_DEMAP_EN_DISABLING_DEFAULT << 1)   /**< Shifted mode DEFAULT for DEMAP_EN           */

/* Bit fields for DEMAP SWRST */
#define _DEMAP_SWRST_RESETVALUE                    0x00000000UL                          /**< Default value for DEMAP_SWRST               */
#define _DEMAP_SWRST_MASK                          0x00000003UL                          /**< Mask for DEMAP_SWRST                        */
#define DEMAP_SWRST_SWRST                          (0x1UL << 0)                          /**< Software Reset Command                      */
#define _DEMAP_SWRST_SWRST_SHIFT                   0                                     /**< Shift value for DEMAP_SWRST                 */
#define _DEMAP_SWRST_SWRST_MASK                    0x1UL                                 /**< Bit mask for DEMAP_SWRST                    */
#define _DEMAP_SWRST_SWRST_DEFAULT                 0x00000000UL                          /**< Mode DEFAULT for DEMAP_SWRST                */
#define DEMAP_SWRST_SWRST_DEFAULT                  (_DEMAP_SWRST_SWRST_DEFAULT << 0)     /**< Shifted mode DEFAULT for DEMAP_SWRST        */
#define DEMAP_SWRST_RESETTING                      (0x1UL << 1)                          /**< Software Reset Busy Status                  */
#define _DEMAP_SWRST_RESETTING_SHIFT               1                                     /**< Shift value for DEMAP_RESETTING             */
#define _DEMAP_SWRST_RESETTING_MASK                0x2UL                                 /**< Bit mask for DEMAP_RESETTING                */
#define _DEMAP_SWRST_RESETTING_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for DEMAP_SWRST                */
#define DEMAP_SWRST_RESETTING_DEFAULT              (_DEMAP_SWRST_RESETTING_DEFAULT << 1) /**< Shifted mode DEFAULT for DEMAP_SWRST        */

/* Bit fields for DEMAP CONNECT */
#define _DEMAP_CONNECT_RESETVALUE                  0x00000000UL                         /**< Default value for DEMAP_CONNECT             */
#define _DEMAP_CONNECT_MASK                        0x00000F07UL                         /**< Mask for DEMAP_CONNECT                      */
#define _DEMAP_CONNECT_IN_SHIFT                    0                                    /**< Shift value for DEMAP_IN                    */
#define _DEMAP_CONNECT_IN_MASK                     0x7UL                                /**< Bit mask for DEMAP_IN                       */
#define _DEMAP_CONNECT_IN_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for DEMAP_CONNECT              */
#define DEMAP_CONNECT_IN_DEFAULT                   (_DEMAP_CONNECT_IN_DEFAULT << 0)     /**< Shifted mode DEFAULT for DEMAP_CONNECT      */
#define _DEMAP_CONNECT_OUT_SHIFT                   8                                    /**< Shift value for DEMAP_OUT                   */
#define _DEMAP_CONNECT_OUT_MASK                    0xF00UL                              /**< Bit mask for DEMAP_OUT                      */
#define _DEMAP_CONNECT_OUT_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for DEMAP_CONNECT              */
#define DEMAP_CONNECT_OUT_DEFAULT                  (_DEMAP_CONNECT_OUT_DEFAULT << 8)    /**< Shifted mode DEFAULT for DEMAP_CONNECT      */

/* Bit fields for DEMAP DISCLK */
#define _DEMAP_DISCLK_RESETVALUE                   0x00000002UL                         /**< Default value for DEMAP_DISCLK              */
#define _DEMAP_DISCLK_MASK                         0x00000003UL                         /**< Mask for DEMAP_DISCLK                       */
#define _DEMAP_DISCLK_DISCLK_SHIFT                 0                                    /**< Shift value for DEMAP_DISCLK                */
#define _DEMAP_DISCLK_DISCLK_MASK                  0x3UL                                /**< Bit mask for DEMAP_DISCLK                   */
#define _DEMAP_DISCLK_DISCLK_DEFAULT               0x00000002UL                         /**< Mode DEFAULT for DEMAP_DISCLK               */
#define _DEMAP_DISCLK_DISCLK_NONE                  0x00000000UL                         /**< Mode NONE for DEMAP_DISCLK                  */
#define _DEMAP_DISCLK_DISCLK_ALL                   0x00000001UL                         /**< Mode ALL for DEMAP_DISCLK                   */
#define _DEMAP_DISCLK_DISCLK_AUTO                  0x00000002UL                         /**< Mode AUTO for DEMAP_DISCLK                  */
#define DEMAP_DISCLK_DISCLK_DEFAULT                (_DEMAP_DISCLK_DISCLK_DEFAULT << 0)  /**< Shifted mode DEFAULT for DEMAP_DISCLK       */
#define DEMAP_DISCLK_DISCLK_NONE                   (_DEMAP_DISCLK_DISCLK_NONE << 0)     /**< Shifted mode NONE for DEMAP_DISCLK          */
#define DEMAP_DISCLK_DISCLK_ALL                    (_DEMAP_DISCLK_DISCLK_ALL << 0)      /**< Shifted mode ALL for DEMAP_DISCLK           */
#define DEMAP_DISCLK_DISCLK_AUTO                   (_DEMAP_DISCLK_DISCLK_AUTO << 0)     /**< Shifted mode AUTO for DEMAP_DISCLK          */

/* Bit fields for DEMAP FIFOIN */
#define _DEMAP_FIFOIN_RESETVALUE                   0x00000000UL                         /**< Default value for DEMAP_FIFOIN              */
#define _DEMAP_FIFOIN_MASK                         0x1FFF3F0FUL                         /**< Mask for DEMAP_FIFOIN                       */
#define _DEMAP_FIFOIN_FID_SHIFT                    0                                    /**< Shift value for DEMAP_FID                   */
#define _DEMAP_FIFOIN_FID_MASK                     0xFUL                                /**< Bit mask for DEMAP_FID                      */
#define _DEMAP_FIFOIN_FID_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for DEMAP_FIFOIN               */
#define DEMAP_FIFOIN_FID_DEFAULT                   (_DEMAP_FIFOIN_FID_DEFAULT << 0)     /**< Shifted mode DEFAULT for DEMAP_FIFOIN       */
#define _DEMAP_FIFOIN_CID_SHIFT                    8                                    /**< Shift value for DEMAP_CID                   */
#define _DEMAP_FIFOIN_CID_MASK                     0x3F00UL                             /**< Bit mask for DEMAP_CID                      */
#define _DEMAP_FIFOIN_CID_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for DEMAP_FIFOIN               */
#define DEMAP_FIFOIN_CID_DEFAULT                   (_DEMAP_FIFOIN_CID_DEFAULT << 8)     /**< Shifted mode DEFAULT for DEMAP_FIFOIN       */
#define _DEMAP_FIFOIN_REM_SHIFT                    16                                   /**< Shift value for DEMAP_REM                   */
#define _DEMAP_FIFOIN_REM_MASK                     0xFF0000UL                           /**< Bit mask for DEMAP_REM                      */
#define _DEMAP_FIFOIN_REM_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for DEMAP_FIFOIN               */
#define DEMAP_FIFOIN_REM_DEFAULT                   (_DEMAP_FIFOIN_REM_DEFAULT << 16)    /**< Shifted mode DEFAULT for DEMAP_FIFOIN       */
#define _DEMAP_FIFOIN_ALARM_SHIFT                  24                                   /**< Shift value for DEMAP_ALARM                 */
#define _DEMAP_FIFOIN_ALARM_MASK                   0x1F000000UL                         /**< Bit mask for DEMAP_ALARM                    */
#define _DEMAP_FIFOIN_ALARM_DEFAULT                0x00000000UL                         /**< Mode DEFAULT for DEMAP_FIFOIN               */
#define DEMAP_FIFOIN_ALARM_DEFAULT                 (_DEMAP_FIFOIN_ALARM_DEFAULT << 24)  /**< Shifted mode DEFAULT for DEMAP_FIFOIN       */

/* Bit fields for DEMAP FIFOOUT */
#define _DEMAP_FIFOOUT_RESETVALUE                  0x00000000UL                         /**< Default value for DEMAP_FIFOOUT             */
#define _DEMAP_FIFOOUT_MASK                        0x1FFF0000UL                         /**< Mask for DEMAP_FIFOOUT                      */
#define _DEMAP_FIFOOUT_CNT_SHIFT                   16                                   /**< Shift value for DEMAP_CNT                   */
#define _DEMAP_FIFOOUT_CNT_MASK                    0xFF0000UL                           /**< Bit mask for DEMAP_CNT                      */
#define _DEMAP_FIFOOUT_CNT_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for DEMAP_FIFOOUT              */
#define DEMAP_FIFOOUT_CNT_DEFAULT                  (_DEMAP_FIFOOUT_CNT_DEFAULT << 16)   /**< Shifted mode DEFAULT for DEMAP_FIFOOUT      */
#define _DEMAP_FIFOOUT_ALARM_SHIFT                 24                                   /**< Shift value for DEMAP_ALARM                 */
#define _DEMAP_FIFOOUT_ALARM_MASK                  0x1F000000UL                         /**< Bit mask for DEMAP_ALARM                    */
#define _DEMAP_FIFOOUT_ALARM_DEFAULT               0x00000000UL                         /**< Mode DEFAULT for DEMAP_FIFOOUT              */
#define DEMAP_FIFOOUT_ALARM_DEFAULT                (_DEMAP_FIFOOUT_ALARM_DEFAULT << 24) /**< Shifted mode DEFAULT for DEMAP_FIFOOUT      */

/* Bit fields for DEMAP FMTINCSI */
#define _DEMAP_FMTINCSI_RESETVALUE                 0x00000000UL                               /**< Default value for DEMAP_FMTINCSI            */
#define _DEMAP_FMTINCSI_MASK                       0x00030000UL                               /**< Mask for DEMAP_FMTINCSI                     */
#define _DEMAP_FMTINCSI_ELEMALIGN_SHIFT            16                                         /**< Shift value for DEMAP_ELEMALIGN             */
#define _DEMAP_FMTINCSI_ELEMALIGN_MASK             0x30000UL                                  /**< Bit mask for DEMAP_ELEMALIGN                */
#define _DEMAP_FMTINCSI_ELEMALIGN_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for DEMAP_FMTINCSI             */
#define _DEMAP_FMTINCSI_ELEMALIGN_WORD             0x00000000UL                               /**< Mode WORD for DEMAP_FMTINCSI                */
#define _DEMAP_FMTINCSI_ELEMALIGN_HALFWORD         0x00000001UL                               /**< Mode HALFWORD for DEMAP_FMTINCSI            */
#define _DEMAP_FMTINCSI_ELEMALIGN_BYTE             0x00000002UL                               /**< Mode BYTE for DEMAP_FMTINCSI                */
#define DEMAP_FMTINCSI_ELEMALIGN_DEFAULT           (_DEMAP_FMTINCSI_ELEMALIGN_DEFAULT << 16)  /**< Shifted mode DEFAULT for DEMAP_FMTINCSI     */
#define DEMAP_FMTINCSI_ELEMALIGN_WORD              (_DEMAP_FMTINCSI_ELEMALIGN_WORD << 16)     /**< Shifted mode WORD for DEMAP_FMTINCSI        */
#define DEMAP_FMTINCSI_ELEMALIGN_HALFWORD          (_DEMAP_FMTINCSI_ELEMALIGN_HALFWORD << 16) /**< Shifted mode HALFWORD for DEMAP_FMTINCSI    */
#define DEMAP_FMTINCSI_ELEMALIGN_BYTE              (_DEMAP_FMTINCSI_ELEMALIGN_BYTE << 16)     /**< Shifted mode BYTE for DEMAP_FMTINCSI        */

/* Bit fields for DEMAP FMTOUTLLR */
#define _DEMAP_FMTOUTLLR_RESETVALUE                0x00000000UL                                /**< Default value for DEMAP_FMTOUTLLR           */
#define _DEMAP_FMTOUTLLR_MASK                      0x00030307UL                                /**< Mask for DEMAP_FMTOUTLLR                    */
#define _DEMAP_FMTOUTLLR_ELEMSIZE_SHIFT            0                                           /**< Shift value for DEMAP_ELEMSIZE              */
#define _DEMAP_FMTOUTLLR_ELEMSIZE_MASK             0x7UL                                       /**< Bit mask for DEMAP_ELEMSIZE                 */
#define _DEMAP_FMTOUTLLR_ELEMSIZE_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for DEMAP_FMTOUTLLR            */
#define DEMAP_FMTOUTLLR_ELEMSIZE_DEFAULT           (_DEMAP_FMTOUTLLR_ELEMSIZE_DEFAULT << 0)    /**< Shifted mode DEFAULT for DEMAP_FMTOUTLLR    */
#define _DEMAP_FMTOUTLLR_ELEMNB_SHIFT              8                                           /**< Shift value for DEMAP_ELEMNB                */
#define _DEMAP_FMTOUTLLR_ELEMNB_MASK               0x300UL                                     /**< Bit mask for DEMAP_ELEMNB                   */
#define _DEMAP_FMTOUTLLR_ELEMNB_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for DEMAP_FMTOUTLLR            */
#define _DEMAP_FMTOUTLLR_ELEMNB_ONE                0x00000000UL                                /**< Mode ONE for DEMAP_FMTOUTLLR                */
#define _DEMAP_FMTOUTLLR_ELEMNB_TWO                0x00000001UL                                /**< Mode TWO for DEMAP_FMTOUTLLR                */
#define _DEMAP_FMTOUTLLR_ELEMNB_FOUR               0x00000002UL                                /**< Mode FOUR for DEMAP_FMTOUTLLR               */
#define DEMAP_FMTOUTLLR_ELEMNB_DEFAULT             (_DEMAP_FMTOUTLLR_ELEMNB_DEFAULT << 8)      /**< Shifted mode DEFAULT for DEMAP_FMTOUTLLR    */
#define DEMAP_FMTOUTLLR_ELEMNB_ONE                 (_DEMAP_FMTOUTLLR_ELEMNB_ONE << 8)          /**< Shifted mode ONE for DEMAP_FMTOUTLLR        */
#define DEMAP_FMTOUTLLR_ELEMNB_TWO                 (_DEMAP_FMTOUTLLR_ELEMNB_TWO << 8)          /**< Shifted mode TWO for DEMAP_FMTOUTLLR        */
#define DEMAP_FMTOUTLLR_ELEMNB_FOUR                (_DEMAP_FMTOUTLLR_ELEMNB_FOUR << 8)         /**< Shifted mode FOUR for DEMAP_FMTOUTLLR       */
#define _DEMAP_FMTOUTLLR_ELEMALIGN_SHIFT           16                                          /**< Shift value for DEMAP_ELEMALIGN             */
#define _DEMAP_FMTOUTLLR_ELEMALIGN_MASK            0x30000UL                                   /**< Bit mask for DEMAP_ELEMALIGN                */
#define _DEMAP_FMTOUTLLR_ELEMALIGN_DEFAULT         0x00000000UL                                /**< Mode DEFAULT for DEMAP_FMTOUTLLR            */
#define _DEMAP_FMTOUTLLR_ELEMALIGN_WORD            0x00000000UL                                /**< Mode WORD for DEMAP_FMTOUTLLR               */
#define _DEMAP_FMTOUTLLR_ELEMALIGN_HALFWORD        0x00000001UL                                /**< Mode HALFWORD for DEMAP_FMTOUTLLR           */
#define _DEMAP_FMTOUTLLR_ELEMALIGN_BYTE            0x00000002UL                                /**< Mode BYTE for DEMAP_FMTOUTLLR               */
#define DEMAP_FMTOUTLLR_ELEMALIGN_DEFAULT          (_DEMAP_FMTOUTLLR_ELEMALIGN_DEFAULT << 16)  /**< Shifted mode DEFAULT for DEMAP_FMTOUTLLR    */
#define DEMAP_FMTOUTLLR_ELEMALIGN_WORD             (_DEMAP_FMTOUTLLR_ELEMALIGN_WORD << 16)     /**< Shifted mode WORD for DEMAP_FMTOUTLLR       */
#define DEMAP_FMTOUTLLR_ELEMALIGN_HALFWORD         (_DEMAP_FMTOUTLLR_ELEMALIGN_HALFWORD << 16) /**< Shifted mode HALFWORD for DEMAP_FMTOUTLLR   */
#define DEMAP_FMTOUTLLR_ELEMALIGN_BYTE             (_DEMAP_FMTOUTLLR_ELEMALIGN_BYTE << 16)     /**< Shifted mode BYTE for DEMAP_FMTOUTLLR       */

/* Bit fields for DEMAP FMTOUTERR */
#define _DEMAP_FMTOUTERR_RESETVALUE                0x00000000UL                                /**< Default value for DEMAP_FMTOUTERR           */
#define _DEMAP_FMTOUTERR_MASK                      0x0003000FUL                                /**< Mask for DEMAP_FMTOUTERR                    */
#define _DEMAP_FMTOUTERR_ELEMSIZE_SHIFT            0                                           /**< Shift value for DEMAP_ELEMSIZE              */
#define _DEMAP_FMTOUTERR_ELEMSIZE_MASK             0xFUL                                       /**< Bit mask for DEMAP_ELEMSIZE                 */
#define _DEMAP_FMTOUTERR_ELEMSIZE_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for DEMAP_FMTOUTERR            */
#define DEMAP_FMTOUTERR_ELEMSIZE_DEFAULT           (_DEMAP_FMTOUTERR_ELEMSIZE_DEFAULT << 0)    /**< Shifted mode DEFAULT for DEMAP_FMTOUTERR    */
#define _DEMAP_FMTOUTERR_ELEMALIGN_SHIFT           16                                          /**< Shift value for DEMAP_ELEMALIGN             */
#define _DEMAP_FMTOUTERR_ELEMALIGN_MASK            0x30000UL                                   /**< Bit mask for DEMAP_ELEMALIGN                */
#define _DEMAP_FMTOUTERR_ELEMALIGN_DEFAULT         0x00000000UL                                /**< Mode DEFAULT for DEMAP_FMTOUTERR            */
#define _DEMAP_FMTOUTERR_ELEMALIGN_WORD            0x00000000UL                                /**< Mode WORD for DEMAP_FMTOUTERR               */
#define _DEMAP_FMTOUTERR_ELEMALIGN_HALFWORD        0x00000001UL                                /**< Mode HALFWORD for DEMAP_FMTOUTERR           */
#define _DEMAP_FMTOUTERR_ELEMALIGN_BYTE            0x00000002UL                                /**< Mode BYTE for DEMAP_FMTOUTERR               */
#define DEMAP_FMTOUTERR_ELEMALIGN_DEFAULT          (_DEMAP_FMTOUTERR_ELEMALIGN_DEFAULT << 16)  /**< Shifted mode DEFAULT for DEMAP_FMTOUTERR    */
#define DEMAP_FMTOUTERR_ELEMALIGN_WORD             (_DEMAP_FMTOUTERR_ELEMALIGN_WORD << 16)     /**< Shifted mode WORD for DEMAP_FMTOUTERR       */
#define DEMAP_FMTOUTERR_ELEMALIGN_HALFWORD         (_DEMAP_FMTOUTERR_ELEMALIGN_HALFWORD << 16) /**< Shifted mode HALFWORD for DEMAP_FMTOUTERR   */
#define DEMAP_FMTOUTERR_ELEMALIGN_BYTE             (_DEMAP_FMTOUTERR_ELEMALIGN_BYTE << 16)     /**< Shifted mode BYTE for DEMAP_FMTOUTERR       */

