SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_demap.h
/* Bit fields for DEMAP DEMAPCTRL */
#define _DEMAP_DEMAPCTRL_RESETVALUE                0x00000005UL                                /**< Default value for DEMAP_DEMAPCTRL           */
#define _DEMAP_DEMAPCTRL_MASK                      0x001FFFFFUL                                /**< Mask for DEMAP_DEMAPCTRL                    */
#define DEMAP_DEMAPCTRL_LLROUTEN                   (0x1UL << 0)                                /**< New BitField                                */
#define _DEMAP_DEMAPCTRL_LLROUTEN_SHIFT            0                                           /**< Shift value for DEMAP_LLROUTEN              */
#define _DEMAP_DEMAPCTRL_LLROUTEN_MASK             0x1UL                                       /**< Bit mask for DEMAP_LLROUTEN                 */
#define _DEMAP_DEMAPCTRL_LLROUTEN_DEFAULT          0x00000001UL                                /**< Mode DEFAULT for DEMAP_DEMAPCTRL            */
#define DEMAP_DEMAPCTRL_LLROUTEN_DEFAULT           (_DEMAP_DEMAPCTRL_LLROUTEN_DEFAULT << 0)    /**< Shifted mode DEFAULT for DEMAP_DEMAPCTRL    */
#define DEMAP_DEMAPCTRL_ERROUTEN                   (0x1UL << 1)                                /**< New BitField                                */
#define _DEMAP_DEMAPCTRL_ERROUTEN_SHIFT            1                                           /**< Shift value for DEMAP_ERROUTEN              */
#define _DEMAP_DEMAPCTRL_ERROUTEN_MASK             0x2UL                                       /**< Bit mask for DEMAP_ERROUTEN                 */
#define _DEMAP_DEMAPCTRL_ERROUTEN_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for DEMAP_DEMAPCTRL            */
#define DEMAP_DEMAPCTRL_ERROUTEN_DEFAULT           (_DEMAP_DEMAPCTRL_ERROUTEN_DEFAULT << 1)    /**< Shifted mode DEFAULT for DEMAP_DEMAPCTRL    */
#define DEMAP_DEMAPCTRL_DECOUTEN                   (0x1UL << 2)                                /**< New BitField                                */
#define _DEMAP_DEMAPCTRL_DECOUTEN_SHIFT            2                                           /**< Shift value for DEMAP_DECOUTEN              */
#define _DEMAP_DEMAPCTRL_DECOUTEN_MASK             0x4UL                                       /**< Bit mask for DEMAP_DECOUTEN                 */
#define _DEMAP_DEMAPCTRL_DECOUTEN_DEFAULT          0x00000001UL                                /**< Mode DEFAULT for DEMAP_DEMAPCTRL            */
#define DEMAP_DEMAPCTRL_DECOUTEN_DEFAULT           (_DEMAP_DEMAPCTRL_DECOUTEN_DEFAULT << 2)    /**< Shifted mode DEFAULT for DEMAP_DEMAPCTRL    */
#define _DEMAP_DEMAPCTRL_DECOUTSHIFT_SHIFT         3                                           /**< Shift value for DEMAP_DECOUTSHIFT           */
#define _DEMAP_DEMAPCTRL_DECOUTSHIFT_MASK          0x18UL                                      /**< Bit mask for DEMAP_DECOUTSHIFT              */
#define _DEMAP_DEMAPCTRL_DECOUTSHIFT_DEFAULT       0x00000000UL                                /**< Mode DEFAULT for DEMAP_DEMAPCTRL            */
#define DEMAP_DEMAPCTRL_DECOUTSHIFT_DEFAULT        (_DEMAP_DEMAPCTRL_DECOUTSHIFT_DEFAULT << 3) /**< Shifted mode DEFAULT for DEMAP_DEMAPCTRL    */
#define DEMAP_DEMAPCTRL_DECOUTCROSS                (0x1UL << 5)                                /**< New BitField                                */
#define _DEMAP_DEMAPCTRL_DECOUTCROSS_SHIFT         5                                           /**< Shift value for DEMAP_DECOUTCROSS           */
#define _DEMAP_DEMAPCTRL_DECOUTCROSS_MASK          0x20UL                                      /**< Bit mask for DEMAP_DECOUTCROSS              */
#define _DEMAP_DEMAPCTRL_DECOUTCROSS_DEFAULT       0x00000000UL                                /**< Mode DEFAULT for DEMAP_DEMAPCTRL            */
#define DEMAP_DEMAPCTRL_DECOUTCROSS_DEFAULT        (_DEMAP_DEMAPCTRL_DECOUTCROSS_DEFAULT << 5) /**< Shifted mode DEFAULT for DEMAP_DEMAPCTRL    */
#define DEMAP_DEMAPCTRL_DECOUTMODE                 (0x1UL << 6)                                /**< New BitField                                */
#define _DEMAP_DEMAPCTRL_DECOUTMODE_SHIFT          6                                           /**< Shift value for DEMAP_DECOUTMODE            */
#define _DEMAP_DEMAPCTRL_DECOUTMODE_MASK           0x40UL                                      /**< Bit mask for DEMAP_DECOUTMODE               */
#define _DEMAP_DEMAPCTRL_DECOUTMODE_DEFAULT        0x00000000UL                                /**< Mode DEFAULT for DEMAP_DEMAPCTRL            */
#define DEMAP_DEMAPCTRL_DECOUTMODE_DEFAULT         (_DEMAP_DEMAPCTRL_DECOUTMODE_DEFAULT << 6)  /**< Shifted mode DEFAULT for DEMAP_DEMAPCTRL    */
#define _DEMAP_DEMAPCTRL_CSIEN_SHIFT               7                                           /**< Shift value for DEMAP_CSIEN                 */
#define _DEMAP_DEMAPCTRL_CSIEN_MASK                0x180UL                                     /**< Bit mask for DEMAP_CSIEN                    */
#define _DEMAP_DEMAPCTRL_CSIEN_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for DEMAP_DEMAPCTRL            */
#define _DEMAP_DEMAPCTRL_CSIEN_no                  0x00000000UL                                /**< Mode no for DEMAP_DEMAPCTRL                 */
#define _DEMAP_DEMAPCTRL_CSIEN_llr_err             0x00000001UL                                /**< Mode llr_err for DEMAP_DEMAPCTRL            */
#define _DEMAP_DEMAPCTRL_CSIEN_llr                 0x00000002UL                                /**< Mode llr for DEMAP_DEMAPCTRL                */
#define _DEMAP_DEMAPCTRL_CSIEN_err                 0x00000003UL                                /**< Mode err for DEMAP_DEMAPCTRL                */
#define DEMAP_DEMAPCTRL_CSIEN_DEFAULT              (_DEMAP_DEMAPCTRL_CSIEN_DEFAULT << 7)       /**< Shifted mode DEFAULT for DEMAP_DEMAPCTRL    */
#define DEMAP_DEMAPCTRL_CSIEN_no                   (_DEMAP_DEMAPCTRL_CSIEN_no << 7)            /**< Shifted mode no for DEMAP_DEMAPCTRL         */
#define DEMAP_DEMAPCTRL_CSIEN_llr_err              (_DEMAP_DEMAPCTRL_CSIEN_llr_err << 7)       /**< Shifted mode llr_err for DEMAP_DEMAPCTRL    */
#define DEMAP_DEMAPCTRL_CSIEN_llr                  (_DEMAP_DEMAPCTRL_CSIEN_llr << 7)           /**< Shifted mode llr for DEMAP_DEMAPCTRL        */
#define DEMAP_DEMAPCTRL_CSIEN_err                  (_DEMAP_DEMAPCTRL_CSIEN_err << 7)           /**< Shifted mode err for DEMAP_DEMAPCTRL        */
#define DEMAP_DEMAPCTRL_CSIERRMODE                 (0x1UL << 9)                                /**< New BitField                                */
#define _DEMAP_DEMAPCTRL_CSIERRMODE_SHIFT          9                                           /**< Shift value for DEMAP_CSIERRMODE            */
#define _DEMAP_DEMAPCTRL_CSIERRMODE_MASK           0x200UL                                     /**< Bit mask for DEMAP_CSIERRMODE               */
#define _DEMAP_DEMAPCTRL_CSIERRMODE_DEFAULT        0x00000000UL                                /**< Mode DEFAULT for DEMAP_DEMAPCTRL            */
#define _DEMAP_DEMAPCTRL_CSIERRMODE_MULT           0x00000000UL                                /**< Mode MULT for DEMAP_DEMAPCTRL               */
#define _DEMAP_DEMAPCTRL_CSIERRMODE_THR            0x00000001UL                                /**< Mode THR for DEMAP_DEMAPCTRL                */
#define DEMAP_DEMAPCTRL_CSIERRMODE_DEFAULT         (_DEMAP_DEMAPCTRL_CSIERRMODE_DEFAULT << 9)  /**< Shifted mode DEFAULT for DEMAP_DEMAPCTRL    */
#define DEMAP_DEMAPCTRL_CSIERRMODE_MULT            (_DEMAP_DEMAPCTRL_CSIERRMODE_MULT << 9)     /**< Shifted mode MULT for DEMAP_DEMAPCTRL       */
#define DEMAP_DEMAPCTRL_CSIERRMODE_THR             (_DEMAP_DEMAPCTRL_CSIERRMODE_THR << 9)      /**< Shifted mode THR for DEMAP_DEMAPCTRL        */
#define _DEMAP_DEMAPCTRL_CSITHR_SHIFT              10                                          /**< Shift value for DEMAP_CSITHR                */
#define _DEMAP_DEMAPCTRL_CSITHR_MASK               0x1FFC00UL                                  /**< Bit mask for DEMAP_CSITHR                   */
#define _DEMAP_DEMAPCTRL_CSITHR_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for DEMAP_DEMAPCTRL            */
#define DEMAP_DEMAPCTRL_CSITHR_DEFAULT             (_DEMAP_DEMAPCTRL_CSITHR_DEFAULT << 10)     /**< Shifted mode DEFAULT for DEMAP_DEMAPCTRL    */

/* Bit fields for DEMAP DEMAPLLROUT */
#define _DEMAP_DEMAPLLROUT_RESETVALUE              0x00000310UL                              /**< Default value for DEMAP_DEMAPLLROUT         */
#define _DEMAP_DEMAPLLROUT_MASK                    0x0003C7FFUL                              /**< Mask for DEMAP_DEMAPLLROUT                  */
#define _DEMAP_DEMAPLLROUT_GAINNUM_SHIFT           0                                         /**< Shift value for DEMAP_GAINNUM               */
#define _DEMAP_DEMAPLLROUT_GAINNUM_MASK            0x3FUL                                    /**< Bit mask for DEMAP_GAINNUM                  */
#define _DEMAP_DEMAPLLROUT_GAINNUM_DEFAULT         0x00000010UL                              /**< Mode DEFAULT for DEMAP_DEMAPLLROUT          */
#define DEMAP_DEMAPLLROUT_GAINNUM_DEFAULT          (_DEMAP_DEMAPLLROUT_GAINNUM_DEFAULT << 0) /**< Shifted mode DEFAULT for DEMAP_DEMAPLLROUT  */
#define _DEMAP_DEMAPLLROUT_GAINDEN_SHIFT           6                                         /**< Shift value for DEMAP_GAINDEN               */
#define _DEMAP_DEMAPLLROUT_GAINDEN_MASK            0x7C0UL                                   /**< Bit mask for DEMAP_GAINDEN                  */
#define _DEMAP_DEMAPLLROUT_GAINDEN_DEFAULT         0x0000000CUL                              /**< Mode DEFAULT for DEMAP_DEMAPLLROUT          */
#define DEMAP_DEMAPLLROUT_GAINDEN_DEFAULT          (_DEMAP_DEMAPLLROUT_GAINDEN_DEFAULT << 6) /**< Shifted mode DEFAULT for DEMAP_DEMAPLLROUT  */
#define _DEMAP_DEMAPLLROUT_NB_SHIFT                14                                        /**< Shift value for DEMAP_NB                    */
#define _DEMAP_DEMAPLLROUT_NB_MASK                 0x3C000UL                                 /**< Bit mask for DEMAP_NB                       */
#define _DEMAP_DEMAPLLROUT_NB_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for DEMAP_DEMAPLLROUT          */
#define DEMAP_DEMAPLLROUT_NB_DEFAULT               (_DEMAP_DEMAPLLROUT_NB_DEFAULT << 14)     /**< Shifted mode DEFAULT for DEMAP_DEMAPLLROUT  */

/* Bit fields for DEMAP DEMAPERROUT */
#define _DEMAP_DEMAPERROUT_RESETVALUE              0x00000000UL                           /**< Default value for DEMAP_DEMAPERROUT         */
#define _DEMAP_DEMAPERROUT_MASK                    0x0000007FUL                           /**< Mask for DEMAP_DEMAPERROUT                  */
#define _DEMAP_DEMAPERROUT_GAIN_SHIFT              0                                      /**< Shift value for DEMAP_GAIN                  */
#define _DEMAP_DEMAPERROUT_GAIN_MASK               0x1FUL                                 /**< Bit mask for DEMAP_GAIN                     */
#define _DEMAP_DEMAPERROUT_GAIN_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for DEMAP_DEMAPERROUT          */
#define DEMAP_DEMAPERROUT_GAIN_DEFAULT             (_DEMAP_DEMAPERROUT_GAIN_DEFAULT << 0) /**< Shifted mode DEFAULT for DEMAP_DEMAPERROUT  */
#define _DEMAP_DEMAPERROUT_NB_SHIFT                5                                      /**< Shift value for DEMAP_NB                    */
#define _DEMAP_DEMAPERROUT_NB_MASK                 0x60UL                                 /**< Bit mask for DEMAP_NB                       */
#define _DEMAP_DEMAPERROUT_NB_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for DEMAP_DEMAPERROUT          */
#define DEMAP_DEMAPERROUT_NB_DEFAULT               (_DEMAP_DEMAPERROUT_NB_DEFAULT << 5)   /**< Shifted mode DEFAULT for DEMAP_DEMAPERROUT  */

/* Bit fields for DEMAP DEMAPSTAT */
#define _DEMAP_DEMAPSTAT_RESETVALUE                0x00000000UL                              /**< Default value for DEMAP_DEMAPSTAT           */
#define _DEMAP_DEMAPSTAT_MASK                      0x000001FFUL                              /**< Mask for DEMAP_DEMAPSTAT                    */
#define _DEMAP_DEMAPSTAT_CSILOWVAL_SHIFT           0                                         /**< Shift value for DEMAP_CSILOWVAL             */
#define _DEMAP_DEMAPSTAT_CSILOWVAL_MASK            0x1FFUL                                   /**< Bit mask for DEMAP_CSILOWVAL                */
#define _DEMAP_DEMAPSTAT_CSILOWVAL_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for DEMAP_DEMAPSTAT            */
#define DEMAP_DEMAPSTAT_CSILOWVAL_DEFAULT          (_DEMAP_DEMAPSTAT_CSILOWVAL_DEFAULT << 0) /**< Shifted mode DEFAULT for DEMAP_DEMAPSTAT    */

/* Bit fields for DEMAP DEMAPALARM */
#define _DEMAP_DEMAPALARM_RESETVALUE               0x00000000UL                               /**< Default value for DEMAP_DEMAPALARM          */
#define _DEMAP_DEMAPALARM_MASK                     0x0000001FUL                               /**< Mask for DEMAP_DEMAPALARM                   */
#define _DEMAP_DEMAPALARM_FIFOINOUT_SHIFT          0                                          /**< Shift value for DEMAP_FIFOINOUT             */
#define _DEMAP_DEMAPALARM_FIFOINOUT_MASK           0x1FUL                                     /**< Bit mask for DEMAP_FIFOINOUT                */
#define _DEMAP_DEMAPALARM_FIFOINOUT_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for DEMAP_DEMAPALARM           */
#define DEMAP_DEMAPALARM_FIFOINOUT_DEFAULT         (_DEMAP_DEMAPALARM_FIFOINOUT_DEFAULT << 0) /**< Shifted mode DEFAULT for DEMAP_DEMAPALARM   */

