SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_demap.h
/* Bit fields for DEMAP DEMAPLLR_CTRL */
#define _DEMAP_DEMAPLLR_CTRL_RESETVALUE            0x00000023UL                                    /**< Default value for DEMAP_DEMAPLLR_CTRL       */
#define _DEMAP_DEMAPLLR_CTRL_MASK                  0x01FFFFFFUL                                    /**< Mask for DEMAP_DEMAPLLR_CTRL                */
#define _DEMAP_DEMAPLLR_CTRL_IQNBIT_SHIFT          0                                               /**< Shift value for DEMAP_IQNBIT                */
#define _DEMAP_DEMAPLLR_CTRL_IQNBIT_MASK           0x7UL                                           /**< Bit mask for DEMAP_IQNBIT                   */
#define _DEMAP_DEMAPLLR_CTRL_IQNBIT_DEFAULT        0x00000003UL                                    /**< Mode DEFAULT for DEMAP_DEMAPLLR_CTRL        */
#define _DEMAP_DEMAPLLR_CTRL_IQNBIT_FIVE           0x00000000UL                                    /**< Mode FIVE for DEMAP_DEMAPLLR_CTRL           */
#define _DEMAP_DEMAPLLR_CTRL_IQNBIT_SIX            0x00000001UL                                    /**< Mode SIX for DEMAP_DEMAPLLR_CTRL            */
#define _DEMAP_DEMAPLLR_CTRL_IQNBIT_SEVEN          0x00000002UL                                    /**< Mode SEVEN for DEMAP_DEMAPLLR_CTRL          */
#define _DEMAP_DEMAPLLR_CTRL_IQNBIT_EIGHT          0x00000003UL                                    /**< Mode EIGHT for DEMAP_DEMAPLLR_CTRL          */
#define _DEMAP_DEMAPLLR_CTRL_IQNBIT_NINE           0x00000004UL                                    /**< Mode NINE for DEMAP_DEMAPLLR_CTRL           */
#define _DEMAP_DEMAPLLR_CTRL_IQNBIT_TEN            0x00000005UL                                    /**< Mode TEN for DEMAP_DEMAPLLR_CTRL            */
#define _DEMAP_DEMAPLLR_CTRL_IQNBIT_ELEVEN         0x00000006UL                                    /**< Mode ELEVEN for DEMAP_DEMAPLLR_CTRL         */
#define _DEMAP_DEMAPLLR_CTRL_IQNBIT_TWELVE         0x00000007UL                                    /**< Mode TWELVE for DEMAP_DEMAPLLR_CTRL         */
#define DEMAP_DEMAPLLR_CTRL_IQNBIT_DEFAULT         (_DEMAP_DEMAPLLR_CTRL_IQNBIT_DEFAULT << 0)      /**< Shifted mode DEFAULT for DEMAP_DEMAPLLR_CTRL*/
#define DEMAP_DEMAPLLR_CTRL_IQNBIT_FIVE            (_DEMAP_DEMAPLLR_CTRL_IQNBIT_FIVE << 0)         /**< Shifted mode FIVE for DEMAP_DEMAPLLR_CTRL   */
#define DEMAP_DEMAPLLR_CTRL_IQNBIT_SIX             (_DEMAP_DEMAPLLR_CTRL_IQNBIT_SIX << 0)          /**< Shifted mode SIX for DEMAP_DEMAPLLR_CTRL    */
#define DEMAP_DEMAPLLR_CTRL_IQNBIT_SEVEN           (_DEMAP_DEMAPLLR_CTRL_IQNBIT_SEVEN << 0)        /**< Shifted mode SEVEN for DEMAP_DEMAPLLR_CTRL  */
#define DEMAP_DEMAPLLR_CTRL_IQNBIT_EIGHT           (_DEMAP_DEMAPLLR_CTRL_IQNBIT_EIGHT << 0)        /**< Shifted mode EIGHT for DEMAP_DEMAPLLR_CTRL  */
#define DEMAP_DEMAPLLR_CTRL_IQNBIT_NINE            (_DEMAP_DEMAPLLR_CTRL_IQNBIT_NINE << 0)         /**< Shifted mode NINE for DEMAP_DEMAPLLR_CTRL   */
#define DEMAP_DEMAPLLR_CTRL_IQNBIT_TEN             (_DEMAP_DEMAPLLR_CTRL_IQNBIT_TEN << 0)          /**< Shifted mode TEN for DEMAP_DEMAPLLR_CTRL    */
#define DEMAP_DEMAPLLR_CTRL_IQNBIT_ELEVEN          (_DEMAP_DEMAPLLR_CTRL_IQNBIT_ELEVEN << 0)       /**< Shifted mode ELEVEN for DEMAP_DEMAPLLR_CTRL */
#define DEMAP_DEMAPLLR_CTRL_IQNBIT_TWELVE          (_DEMAP_DEMAPLLR_CTRL_IQNBIT_TWELVE << 0)       /**< Shifted mode TWELVE for DEMAP_DEMAPLLR_CTRL */
#define _DEMAP_DEMAPLLR_CTRL_IQDEP_SHIFT           3                                               /**< Shift value for DEMAP_IQDEP                 */
#define _DEMAP_DEMAPLLR_CTRL_IQDEP_MASK            0x18UL                                          /**< Bit mask for DEMAP_IQDEP                    */
#define _DEMAP_DEMAPLLR_CTRL_IQDEP_DEFAULT         0x00000000UL                                    /**< Mode DEFAULT for DEMAP_DEMAPLLR_CTRL        */
#define _DEMAP_DEMAPLLR_CTRL_IQDEP_I               0x00000000UL                                    /**< Mode I for DEMAP_DEMAPLLR_CTRL              */
#define _DEMAP_DEMAPLLR_CTRL_IQDEP_Q               0x00000001UL                                    /**< Mode Q for DEMAP_DEMAPLLR_CTRL              */
#define _DEMAP_DEMAPLLR_CTRL_IQDEP_IQ              0x00000002UL                                    /**< Mode IQ for DEMAP_DEMAPLLR_CTRL             */
#define _DEMAP_DEMAPLLR_CTRL_IQDEP_IQ_switch       0x00000003UL                                    /**< Mode IQ_switch for DEMAP_DEMAPLLR_CTRL      */
#define DEMAP_DEMAPLLR_CTRL_IQDEP_DEFAULT          (_DEMAP_DEMAPLLR_CTRL_IQDEP_DEFAULT << 3)       /**< Shifted mode DEFAULT for DEMAP_DEMAPLLR_CTRL*/
#define DEMAP_DEMAPLLR_CTRL_IQDEP_I                (_DEMAP_DEMAPLLR_CTRL_IQDEP_I << 3)             /**< Shifted mode I for DEMAP_DEMAPLLR_CTRL      */
#define DEMAP_DEMAPLLR_CTRL_IQDEP_Q                (_DEMAP_DEMAPLLR_CTRL_IQDEP_Q << 3)             /**< Shifted mode Q for DEMAP_DEMAPLLR_CTRL      */
#define DEMAP_DEMAPLLR_CTRL_IQDEP_IQ               (_DEMAP_DEMAPLLR_CTRL_IQDEP_IQ << 3)            /**< Shifted mode IQ for DEMAP_DEMAPLLR_CTRL     */
#define DEMAP_DEMAPLLR_CTRL_IQDEP_IQ_switch        (_DEMAP_DEMAPLLR_CTRL_IQDEP_IQ_switch << 3)     /**< Shifted mode IQ_switch for DEMAP_DEMAPLLR_CTRL*/
#define _DEMAP_DEMAPLLR_CTRL_NBIT_SHIFT            5                                               /**< Shift value for DEMAP_NBIT                  */
#define _DEMAP_DEMAPLLR_CTRL_NBIT_MASK             0x60UL                                          /**< Bit mask for DEMAP_NBIT                     */
#define _DEMAP_DEMAPLLR_CTRL_NBIT_DEFAULT          0x00000001UL                                    /**< Mode DEFAULT for DEMAP_DEMAPLLR_CTRL        */
#define _DEMAP_DEMAPLLR_CTRL_NBIT_TWO              0x00000000UL                                    /**< Mode TWO for DEMAP_DEMAPLLR_CTRL            */
#define _DEMAP_DEMAPLLR_CTRL_NBIT_FOUR             0x00000001UL                                    /**< Mode FOUR for DEMAP_DEMAPLLR_CTRL           */
#define _DEMAP_DEMAPLLR_CTRL_NBIT_EIGHT            0x00000002UL                                    /**< Mode EIGHT for DEMAP_DEMAPLLR_CTRL          */
#define _DEMAP_DEMAPLLR_CTRL_NBIT_SIXTEEN          0x00000003UL                                    /**< Mode SIXTEEN for DEMAP_DEMAPLLR_CTRL        */
#define DEMAP_DEMAPLLR_CTRL_NBIT_DEFAULT           (_DEMAP_DEMAPLLR_CTRL_NBIT_DEFAULT << 5)        /**< Shifted mode DEFAULT for DEMAP_DEMAPLLR_CTRL*/
#define DEMAP_DEMAPLLR_CTRL_NBIT_TWO               (_DEMAP_DEMAPLLR_CTRL_NBIT_TWO << 5)            /**< Shifted mode TWO for DEMAP_DEMAPLLR_CTRL    */
#define DEMAP_DEMAPLLR_CTRL_NBIT_FOUR              (_DEMAP_DEMAPLLR_CTRL_NBIT_FOUR << 5)           /**< Shifted mode FOUR for DEMAP_DEMAPLLR_CTRL   */
#define DEMAP_DEMAPLLR_CTRL_NBIT_EIGHT             (_DEMAP_DEMAPLLR_CTRL_NBIT_EIGHT << 5)          /**< Shifted mode EIGHT for DEMAP_DEMAPLLR_CTRL  */
#define DEMAP_DEMAPLLR_CTRL_NBIT_SIXTEEN           (_DEMAP_DEMAPLLR_CTRL_NBIT_SIXTEEN << 5)        /**< Shifted mode SIXTEEN for DEMAP_DEMAPLLR_CTRL*/
#define _DEMAP_DEMAPLLR_CTRL_INVLLR_SHIFT          7                                               /**< Shift value for DEMAP_INVLLR                */
#define _DEMAP_DEMAPLLR_CTRL_INVLLR_MASK           0x380UL                                         /**< Bit mask for DEMAP_INVLLR                   */
#define _DEMAP_DEMAPLLR_CTRL_INVLLR_DEFAULT        0x00000000UL                                    /**< Mode DEFAULT for DEMAP_DEMAPLLR_CTRL        */
#define DEMAP_DEMAPLLR_CTRL_INVLLR_DEFAULT         (_DEMAP_DEMAPLLR_CTRL_INVLLR_DEFAULT << 7)      /**< Shifted mode DEFAULT for DEMAP_DEMAPLLR_CTRL*/
#define DEMAP_DEMAPLLR_CTRL_INVDEC                 (0x1UL << 10)                                   /**< New BitField                                */
#define _DEMAP_DEMAPLLR_CTRL_INVDEC_SHIFT          10                                              /**< Shift value for DEMAP_INVDEC                */
#define _DEMAP_DEMAPLLR_CTRL_INVDEC_MASK           0x400UL                                         /**< Bit mask for DEMAP_INVDEC                   */
#define _DEMAP_DEMAPLLR_CTRL_INVDEC_DEFAULT        0x00000000UL                                    /**< Mode DEFAULT for DEMAP_DEMAPLLR_CTRL        */
#define _DEMAP_DEMAPLLR_CTRL_INVDEC_DONT_INVERT    0x00000000UL                                    /**< Mode DONT_INVERT for DEMAP_DEMAPLLR_CTRL    */
#define _DEMAP_DEMAPLLR_CTRL_INVDEC_INVERT         0x00000001UL                                    /**< Mode INVERT for DEMAP_DEMAPLLR_CTRL         */
#define DEMAP_DEMAPLLR_CTRL_INVDEC_DEFAULT         (_DEMAP_DEMAPLLR_CTRL_INVDEC_DEFAULT << 10)     /**< Shifted mode DEFAULT for DEMAP_DEMAPLLR_CTRL*/
#define DEMAP_DEMAPLLR_CTRL_INVDEC_DONT_INVERT     (_DEMAP_DEMAPLLR_CTRL_INVDEC_DONT_INVERT << 10) /**< Shifted mode DONT_INVERT for DEMAP_DEMAPLLR_CTRL*/
#define DEMAP_DEMAPLLR_CTRL_INVDEC_INVERT          (_DEMAP_DEMAPLLR_CTRL_INVDEC_INVERT << 10)      /**< Shifted mode INVERT for DEMAP_DEMAPLLR_CTRL */
#define _DEMAP_DEMAPLLR_CTRL_LUTADDR_SHIFT         11                                              /**< Shift value for DEMAP_LUTADDR               */
#define _DEMAP_DEMAPLLR_CTRL_LUTADDR_MASK          0x1FFF800UL                                     /**< Bit mask for DEMAP_LUTADDR                  */
#define _DEMAP_DEMAPLLR_CTRL_LUTADDR_DEFAULT       0x00000000UL                                    /**< Mode DEFAULT for DEMAP_DEMAPLLR_CTRL        */
#define DEMAP_DEMAPLLR_CTRL_LUTADDR_DEFAULT        (_DEMAP_DEMAPLLR_CTRL_LUTADDR_DEFAULT << 11)    /**< Shifted mode DEFAULT for DEMAP_DEMAPLLR_CTRL*/

/* Bit fields for DEMAP DEMAPERR_CTRL */
#define _DEMAP_DEMAPERR_CTRL_RESETVALUE            0x00000003UL                                /**< Default value for DEMAP_DEMAPERR_CTRL       */
#define _DEMAP_DEMAPERR_CTRL_MASK                  0x000FFFFFUL                                /**< Mask for DEMAP_DEMAPERR_CTRL                */
#define _DEMAP_DEMAPERR_CTRL_IQNBIT_SHIFT          0                                           /**< Shift value for DEMAP_IQNBIT                */
#define _DEMAP_DEMAPERR_CTRL_IQNBIT_MASK           0x7UL                                       /**< Bit mask for DEMAP_IQNBIT                   */
#define _DEMAP_DEMAPERR_CTRL_IQNBIT_DEFAULT        0x00000003UL                                /**< Mode DEFAULT for DEMAP_DEMAPERR_CTRL        */
#define _DEMAP_DEMAPERR_CTRL_IQNBIT_FIVE           0x00000000UL                                /**< Mode FIVE for DEMAP_DEMAPERR_CTRL           */
#define _DEMAP_DEMAPERR_CTRL_IQNBIT_SIX            0x00000001UL                                /**< Mode SIX for DEMAP_DEMAPERR_CTRL            */
#define _DEMAP_DEMAPERR_CTRL_IQNBIT_SEVEN          0x00000002UL                                /**< Mode SEVEN for DEMAP_DEMAPERR_CTRL          */
#define _DEMAP_DEMAPERR_CTRL_IQNBIT_EIGHT          0x00000003UL                                /**< Mode EIGHT for DEMAP_DEMAPERR_CTRL          */
#define _DEMAP_DEMAPERR_CTRL_IQNBIT_NINE           0x00000004UL                                /**< Mode NINE for DEMAP_DEMAPERR_CTRL           */
#define _DEMAP_DEMAPERR_CTRL_IQNBIT_TEN            0x00000005UL                                /**< Mode TEN for DEMAP_DEMAPERR_CTRL            */
#define _DEMAP_DEMAPERR_CTRL_IQNBIT_ELEVEN         0x00000006UL                                /**< Mode ELEVEN for DEMAP_DEMAPERR_CTRL         */
#define _DEMAP_DEMAPERR_CTRL_IQNBIT_TWELVE         0x00000007UL                                /**< Mode TWELVE for DEMAP_DEMAPERR_CTRL         */
#define DEMAP_DEMAPERR_CTRL_IQNBIT_DEFAULT         (_DEMAP_DEMAPERR_CTRL_IQNBIT_DEFAULT << 0)  /**< Shifted mode DEFAULT for DEMAP_DEMAPERR_CTRL*/
#define DEMAP_DEMAPERR_CTRL_IQNBIT_FIVE            (_DEMAP_DEMAPERR_CTRL_IQNBIT_FIVE << 0)     /**< Shifted mode FIVE for DEMAP_DEMAPERR_CTRL   */
#define DEMAP_DEMAPERR_CTRL_IQNBIT_SIX             (_DEMAP_DEMAPERR_CTRL_IQNBIT_SIX << 0)      /**< Shifted mode SIX for DEMAP_DEMAPERR_CTRL    */
#define DEMAP_DEMAPERR_CTRL_IQNBIT_SEVEN           (_DEMAP_DEMAPERR_CTRL_IQNBIT_SEVEN << 0)    /**< Shifted mode SEVEN for DEMAP_DEMAPERR_CTRL  */
#define DEMAP_DEMAPERR_CTRL_IQNBIT_EIGHT           (_DEMAP_DEMAPERR_CTRL_IQNBIT_EIGHT << 0)    /**< Shifted mode EIGHT for DEMAP_DEMAPERR_CTRL  */
#define DEMAP_DEMAPERR_CTRL_IQNBIT_NINE            (_DEMAP_DEMAPERR_CTRL_IQNBIT_NINE << 0)     /**< Shifted mode NINE for DEMAP_DEMAPERR_CTRL   */
#define DEMAP_DEMAPERR_CTRL_IQNBIT_TEN             (_DEMAP_DEMAPERR_CTRL_IQNBIT_TEN << 0)      /**< Shifted mode TEN for DEMAP_DEMAPERR_CTRL    */
#define DEMAP_DEMAPERR_CTRL_IQNBIT_ELEVEN          (_DEMAP_DEMAPERR_CTRL_IQNBIT_ELEVEN << 0)   /**< Shifted mode ELEVEN for DEMAP_DEMAPERR_CTRL */
#define DEMAP_DEMAPERR_CTRL_IQNBIT_TWELVE          (_DEMAP_DEMAPERR_CTRL_IQNBIT_TWELVE << 0)   /**< Shifted mode TWELVE for DEMAP_DEMAPERR_CTRL */
#define _DEMAP_DEMAPERR_CTRL_IQDEP_SHIFT           3                                           /**< Shift value for DEMAP_IQDEP                 */
#define _DEMAP_DEMAPERR_CTRL_IQDEP_MASK            0x18UL                                      /**< Bit mask for DEMAP_IQDEP                    */
#define _DEMAP_DEMAPERR_CTRL_IQDEP_DEFAULT         0x00000000UL                                /**< Mode DEFAULT for DEMAP_DEMAPERR_CTRL        */
#define _DEMAP_DEMAPERR_CTRL_IQDEP_I               0x00000000UL                                /**< Mode I for DEMAP_DEMAPERR_CTRL              */
#define _DEMAP_DEMAPERR_CTRL_IQDEP_Q               0x00000001UL                                /**< Mode Q for DEMAP_DEMAPERR_CTRL              */
#define _DEMAP_DEMAPERR_CTRL_IQDEP_IQ              0x00000002UL                                /**< Mode IQ for DEMAP_DEMAPERR_CTRL             */
#define DEMAP_DEMAPERR_CTRL_IQDEP_DEFAULT          (_DEMAP_DEMAPERR_CTRL_IQDEP_DEFAULT << 3)   /**< Shifted mode DEFAULT for DEMAP_DEMAPERR_CTRL*/
#define DEMAP_DEMAPERR_CTRL_IQDEP_I                (_DEMAP_DEMAPERR_CTRL_IQDEP_I << 3)         /**< Shifted mode I for DEMAP_DEMAPERR_CTRL      */
#define DEMAP_DEMAPERR_CTRL_IQDEP_Q                (_DEMAP_DEMAPERR_CTRL_IQDEP_Q << 3)         /**< Shifted mode Q for DEMAP_DEMAPERR_CTRL      */
#define DEMAP_DEMAPERR_CTRL_IQDEP_IQ               (_DEMAP_DEMAPERR_CTRL_IQDEP_IQ << 3)        /**< Shifted mode IQ for DEMAP_DEMAPERR_CTRL     */
#define DEMAP_DEMAPERR_CTRL_NBIT                   (0x1UL << 5)                                /**< New BitField                                */
#define _DEMAP_DEMAPERR_CTRL_NBIT_SHIFT            5                                           /**< Shift value for DEMAP_NBIT                  */
#define _DEMAP_DEMAPERR_CTRL_NBIT_MASK             0x20UL                                      /**< Bit mask for DEMAP_NBIT                     */
#define _DEMAP_DEMAPERR_CTRL_NBIT_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for DEMAP_DEMAPERR_CTRL        */
#define _DEMAP_DEMAPERR_CTRL_NBIT_EIGHT            0x00000000UL                                /**< Mode EIGHT for DEMAP_DEMAPERR_CTRL          */
#define _DEMAP_DEMAPERR_CTRL_NBIT_SIXTEEN          0x00000001UL                                /**< Mode SIXTEEN for DEMAP_DEMAPERR_CTRL        */
#define DEMAP_DEMAPERR_CTRL_NBIT_DEFAULT           (_DEMAP_DEMAPERR_CTRL_NBIT_DEFAULT << 5)    /**< Shifted mode DEFAULT for DEMAP_DEMAPERR_CTRL*/
#define DEMAP_DEMAPERR_CTRL_NBIT_EIGHT             (_DEMAP_DEMAPERR_CTRL_NBIT_EIGHT << 5)      /**< Shifted mode EIGHT for DEMAP_DEMAPERR_CTRL  */
#define DEMAP_DEMAPERR_CTRL_NBIT_SIXTEEN           (_DEMAP_DEMAPERR_CTRL_NBIT_SIXTEEN << 5)    /**< Shifted mode SIXTEEN for DEMAP_DEMAPERR_CTRL*/
#define _DEMAP_DEMAPERR_CTRL_LUTADDR_SHIFT         6                                           /**< Shift value for DEMAP_LUTADDR               */
#define _DEMAP_DEMAPERR_CTRL_LUTADDR_MASK          0xFFFC0UL                                   /**< Bit mask for DEMAP_LUTADDR                  */
#define _DEMAP_DEMAPERR_CTRL_LUTADDR_DEFAULT       0x00000000UL                                /**< Mode DEFAULT for DEMAP_DEMAPERR_CTRL        */
#define DEMAP_DEMAPERR_CTRL_LUTADDR_DEFAULT        (_DEMAP_DEMAPERR_CTRL_LUTADDR_DEFAULT << 6) /**< Shifted mode DEFAULT for DEMAP_DEMAPERR_CTRL*/

/** @} End of group EFR32FG25_DEMAP_BitFields */
/** @} End of group EFR32FG25_DEMAP */
/** @} End of group Parts */

#endif /* EFR32FG25_DEMAP_H */
